# !/usr/bin/python3
# _*_ coding:utf-8 _*_
#
# Copyright (C) 2023 - 2023 pgl, Inc. All Rights Reserved 
#
# @Time    : 2023/2/20 17:39
# @Author  : pgl
# @File    : 19_元组和列表的区别.py.py
# @IDE     : PyCharm

# 元组和列表的区别
# 元组和列表都是序列,都能按照一定的顺序存储元素,且内容不受限制
# 列表像铅笔写字, 写错了橡皮擦一下还可以重新写
# 元组就像钢笔写字, 写错了就不能擦了(不包括使用涂改液和修正带)

# 1.元组
# 1.1 不可变序列(不能添加.修改和删除元素, 可以整体替换)
# 1.2 支持切片的操作(只能访问元组中的元素)
# 1.3 元组访问速度快
# 1.4 元素可以作为字典键

# 2.列表
# 2.1 可变序列(随时添加,修改或者删除)
# 2.2 支持切片的操作(可以访问,修改元组中的元素)
# 2.3 列表访问速度慢
# 2.4 列表不能作为字典的键
