# !/usr/bin/python3
# _*_ coding:utf-8 _*_
#
# Copyright (C) 2023 - 2023 pgl, Inc. All Rights Reserved 
#
# @Time    : 2023/2/20 15:19
# @Author  : pgl
# @File    : 01_流程控制语句.py.py
# @IDE     : PyCharm
# 程序结构
# 流程控制语句, 就是按照一定的步骤实现某些功能的语句, 在Python中主要的流程控制语句有5类
# 1. 选择语句,各种if语句预计if语句的嵌套
# 2. 条件表达式
# 3. 循环语句while循环, for循环, 以及循环的嵌套
# 4. 跳转语句, break和continue语句
# 5. pass空语句
# 在学习流程控制语句之前要先了解一个概念: 程序结构
# 程序结构: 顺序结构, 选择结构, 循环结构

# 顺序结构: 按照代码的编写顺序依次执行, 是比较常用
print("机会之一")
print("机会之二")
print("机会之三")
# 依次显示: 机会之一, 机会之二, 机会之三

# 选择结构: 根据条件表达式的结果, 选择执行不同的语句, 通常通过if语句来实现
# 首先判断表达式的结果, 如果为真,执行语句块1,执行完毕结束语句; 如果为假,执行语句块2,执行完毕结束语句

# 循环结构: 在一定条件下反复执行某段程序的流程结构, 先判断条件表达式的结果,
# 如果为真,则执行语句块,语句块执行完毕后再判断表达式的值,如果为真,仍然执行语句块中的代码,执行完毕后再次判断, 直到条件表达式的结果为假才结束循环

