# !/usr/bin/python3
# _*_ coding:utf-8 _*_
#
# Copyright (C) 2023 - 2023 pgl, Inc. All Rights Reserved 
#
# @Time    : 2023/2/20 15:40
# @Author  : pgl
# @File    : 03_序列相加.py.py
# @IDE     : PyCharm

# 序列相加
# 序列相加就使用"+"是把两个相同类型的序列合成一个序列, 如果有相同的元素不会去除
# 序列1 + 序列2 = 序列1序列2
nba1 = ["乔丹", "拉塞尔", "周一", "周二", "周三", "周四", "周五", "周六", "周日", "许巍"]  # 定义一个字符串类型的列表
nba2 = ["霍华德", "韦德", "欧文", "加索尔"]
# 接下来把这两个列表合并成一个列表, 取名为nba
nba = nba1 + nba2
print(nba)
# 只能是同类型的序列相加
# 列表+列表
# 元组+元组
# 字符串+字符串

# "NBA球星:"是字符串, nba1是列表, 两者进行相加输出结果是错误的
# print("NBA球星:" + nba1)

number = [1, 2, 3]  # 数值型的列表
print(nba2 + number)  # 前面的nba2是字符串类型的列表, 后面的number是数值型的列表, 但是都是列表可以相加的
# 同类型可以相加是指同类型的序列不是序列中的内容
