# !/usr/bin/python3
# _*_ coding:utf-8 _*_
#
# Copyright (C) 2023 - 2023 pgl, Inc. All Rights Reserved 
#
# @Time    : 2023/2/20 17:43
# @Author  : pgl
# @File    : 24_字典推导式.py.py
# @IDE     : PyCharm

# 字典推导式
# 字典和列表元组一样,也可是使用字典推导式来快速生成一个字典,形式与列表推导式类似,只不过把列表推导式中的[]换成{}并且在原来的值表达式前面加上一个键表达式
# {键表达式:值表达式 for循环}
# 生成一个包含4个随机数的字典, 因为要生成随机数,所以到导入随机数模块
import random

# 生成随机数字典, 循环变量是i, 范围是从1到5, i也是键,键队形的值是从10到100的随机数
randomdict = {i: random.randint(10, 100) for i in range(1, 5)}  # 生成随机数字典, 循环变量是i, 范围是从1到5
print("输出下这个字典看一下", randomdict)

# 情景模拟,应用字典推导式实现名字和星座创建字典
name = ["小狗", "小猫", "小刺猬", "小兔子"]  # 创建一个名字列表
sign = ['水瓶座', '射手座', '双鱼座', '双子座']  # 保存星座列表
# 通过字典推导式生成一个字典
dict1 = {i: j for i, j in zip(name, sign)}  # 字典推导式
print("字典推导式下的结果:", dict1)
# 创建字典推导式的时候如果能用字典推导式实现建议使用字典推导式实现
