# !/usr/bin/python3
# _*_ coding:utf-8 _*_
#
# Copyright (C) 2023 - 2023 pgl, Inc. All Rights Reserved 
#
# @Time    : 2023/2/21 10:12
# @Author  : pgl
# @File    : 00_面向对象概述.py.py
# @IDE     : PyCharm



# 面向对象概述    针对大型软件使用
# 1.面向对象概述
# 2.类的定义和使用
# 3.属性
# 4.继承

# 面向对象概述
# 面向对象的核心是对象, 万物皆为对象, 如何具体描述对象呢? 对象由属性和方法组成
# 属性: 静态的不变的
# 方法: 动态的

# 类的概念
# 类是一个抽象的概念, 在面向对象中类就是分类的意思, 类就是一组相似事物的统称
# 类相当于图纸, 那么根据图纸生产出来的汽车就可以称之类的对象, 这个图纸不能驾驶, 但是这个汽车可以驾驶

# 封装
# 我们买了一辆汽车, 我们不需要对车的内部解构进行研究, 我们只要驾驶车就行了, 因为汽车生产商对汽车的内部进行了封装, 并给我们留下了可以操作的接口
# 对于面向对象而言, 封装就是把类的内部实现和使用分离开来, 只保留有限的接口与外部进行联系, 对于开发者我们只需要知道如何调用的就行而不需要关心它的内部是如何实现的

# 继承
# 继承与现实生活中继承父母的体貌特征类似, 对于面向对象而言, 子类可以继承父类的属性和方法并且可以重写新的属性和方法, 通过继承我们可以实现代码的重复利用

# 多态
# 多态是指同一事物的多种形态, 水的液态.固态.气态



